In [7]:
import numpy as np
import pandas as pd

In [9]:
read_data = pd.read_csv(r"C:\Users\DELL\Desktop\csv_excel file\online_store_customer_data.csv")

In [10]:
read_data.head()

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
0,1/1/2019,151200,Female,19.0,Single,Kansas,Basic,Unemployment,Other,1.0,2051.36
1,1/1/2019,151201,Male,49.0,Single,Illinois,Basic,self-employed,Card,0.0,544.04
2,1/1/2019,151202,Male,63.0,Married,New Mexico,Basic,workers,PayPal,1.0,1572.60
3,1/1/2019,151203,NaN,18.0,Single,Virginia,Platinum,workers,Card,1.0,1199.79
4,1/1/2019,151204,Male,27.0,Single,Connecticut,Basic,self-employed,Card,0.0,NaN

In [11]:
read_data.tail()

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
2507,5/1/2021,153695,Female,57.0,Single,South Carolina,Platinum,self-employed,Card,0.0,150.10
2508,5/1/2021,153696,Female,36.0,Married,Hawaii,Silver,self-employed,PayPal,1.0,708.88
2509,5/1/2021,153697,Male,22.0,Single,South Carolina,Basic,workers,PayPal,1.0,2030.07
2510,5/1/2021,153698,NaN,44.0,Single,New York,Basic,Employees,PayPal,0.0,1909.77
2511,5/1/2021,153699,Male,48.0,Single,California,Silver,workers,PayPal,1.0,1073.15

In [12]:
read_data.shape

(2512, 11)

In [9]:
read_data.size

27632

In [10]:
read_data.columns

Index(['Transaction_date', 'Transaction_ID', 'Gender', 'Age', 'Marital_status',
       'State_names', 'Segment', 'Employees_status', 'Payment_method',
       'Referal', 'Amount_spent'],
      dtype='object')

In [11]:
read_data.isnull().sum()

Transaction_date      0
Transaction_ID        0
Gender               28
Age                  42
Marital_status        0
State_names           0
Segment               0
Employees_status     26
Payment_method        0
Referal             155
Amount_spent        242
dtype: int64

In [12]:
read_data.dropna(inplace = True)

In [13]:
read_data.shape

(2044, 11)

In [14]:
read_data.size

22484

In [16]:
read_data.isnull().sum()

Transaction_date    0
Transaction_ID      0
Gender              0
Age                 0
Marital_status      0
State_names         0
Segment             0
Employees_status    0
Payment_method      0
Referal             0
Amount_spent        0
dtype: int64

In [17]:
read_data.duplicated().value_counts()

False    2034
True       10
dtype: int64

In [18]:
read_data.drop_duplicates(inplace = True)

In [19]:
read_data.duplicated().value_counts()

False    2034
dtype: int64

In [20]:
read_data.shape

(2034, 11)

In [21]:
read_data.size

22374

In [13]:
read_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2512 entries, 0 to 2511
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction_date  2512 non-null   object
 1   Transaction_ID    2512 non-null   int64
 2   Gender            2484 non-null   object
 3   Age               2470 non-null   float64
 4   Marital_status    2512 non-null   object
 5   State_names       2512 non-null   object
 6   Segment           2512 non-null   object
 7   Employees_status  2486 non-null   object
 8   Payment_method    2512 non-null   object
 9   Referal           2357 non-null   float64
 10  Amount_spent      2270 non-null   float64
dtypes: float64(3), int64(1), object(7)
memory usage: 216.0+ KB

In [14]:
read_data.head(5)

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
0,1/1/2019,151200,Female,19.0,Single,Kansas,Basic,Unemployment,Other,1.0,2051.36
1,1/1/2019,151201,Male,49.0,Single,Illinois,Basic,self-employed,Card,0.0,544.04
2,1/1/2019,151202,Male,63.0,Married,New Mexico,Basic,workers,PayPal,1.0,1572.60
3,1/1/2019,151203,NaN,18.0,Single,Virginia,Platinum,workers,Card,1.0,1199.79
4,1/1/2019,151204,Male,27.0,Single,Connecticut,Basic,self-employed,Card,0.0,NaN

In [25]:
read_data["Transaction_date"] = read_data["Transaction_date"].apply(pd.to_datetime)

In [26]:
read_data.head(5)

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
0,2019-01-01,151200,Female,19.0,Single,Kansas,Basic,Unemployment,Other,1.0,2051.36
1,2019-01-01,151201,Male,49.0,Single,Illinois,Basic,self-employed,Card,0.0,544.04
2,2019-01-01,151202,Male,63.0,Married,New Mexico,Basic,workers,PayPal,1.0,1572.60
5,2019-01-03,151205,Male,71.0,Single,Hawaii,Basic,Employees,PayPal,1.0,2922.66
6,2019-01-03,151206,Female,34.0,Married,New Mexico,Platinum,Employees,PayPal,1.0,1481.42

In [23]:
time = pd.to_datetime("2004-02-21")
update = time.

AttributeError: module 'pandas' has no attribute 'strftime'

In [16]:
read_data.head(5)

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
0,2019-01-01,151200,Female,19.0,Single,Kansas,Basic,Unemployment,Other,1.0,2051.36
1,2019-01-01,151201,Male,49.0,Single,Illinois,Basic,self-employed,Card,0.0,544.04
2,2019-01-01,151202,Male,63.0,Married,New Mexico,Basic,workers,PayPal,1.0,1572.60
3,2019-01-01,151203,NaN,18.0,Single,Virginia,Platinum,workers,Card,1.0,1199.79
4,2019-01-01,151204,Male,27.0,Single,Connecticut,Basic,self-employed,Card,0.0,NaN

In [17]:
date_sr = pd.to_datetime(pd.Series("2012-09-02"))
change_format = date_sr.dt.strftime('%d-%m-%Y')

In [19]:
print(change_format)

0    02-09-2012
dtype: object

In [30]:
date = pd.to_datetime(pd.Series(read_data["Transaction_date"].apply(dt.strftime('%d-%m-%Y'))))

NameError: name 'dt' is not defined

In [29]:
date

0      2019-01-01
1      2019-01-01
2      2019-01-01
3      2019-01-01
4      2019-01-01
          ...
2507   2021-05-01
2508   2021-05-01
2509   2021-05-01
2510   2021-05-01
2511   2021-05-01
Name: Transaction_date, Length: 2512, dtype: datetime64[ns]

In [33]:
import sys #access to system parameters https://docs.python.org/3/library/sys.html
print("Python version: {}". format(sys.version))

import pandas as pd #collection of functions for data processing and analysis modeled after R dataframes with SQL like features
print("pandas version: {}". format(pd.__version__))

import matplotlib #collection of functions for scientific and publication-ready visualization
print("matplotlib version: {}". format(matplotlib.__version__))

import numpy as np #foundational package for scientific computing
print("NumPy version: {}". format(np.__version__))

import scipy as sp #collection of functions for scientific computing and advance mathematics
print("SciPy version: {}". format(sp.__version__)) 

import IPython
from IPython import display #pretty printing of dataframes in Jupyter notebook
print("IPython version: {}". format(IPython.__version__)) 

import sklearn #collection of machine learning algorithms
print("scikit-learn version: {}". format(sklearn.__version__))

#misc libraries
import random
import time


#ignore warnings
import warnings
warnings.filterwarnings('ignore')
print('-'*25)



# Input data files are available in the "../input/" directory.
# For example, running this (by clicking run or pressing Shift+Enter) will list the files in the input directory

Python version: 3.9.7 (default, Sep 16 2021, 16:59:28) [MSC v.1916 64 bit (AMD64)]
pandas version: 1.3.4
matplotlib version: 3.4.3
NumPy version: 1.20.3
SciPy version: 1.7.1
IPython version: 7.29.0
scikit-learn version: 0.24.2
-------------------------

In [37]:
import warnings
warnings.filterwarnings("ignore")
print("--"*12)

------------------------

In [40]:
import scipy
print("scipy version {}".format(scipy.__version__))

scipy version 1.7.1